In [14]:
import mysql.connector

mydb = mysql.connector.connect(
    user='root',
    passwd='root',
    host='localhost',
    database='learning_sql_database'
)

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x0000018CCCF59648>

In [2]:
import pandas as pd

In [9]:
sql = "SHOW tables"

pd.read_sql_query(sql, mydb)

    Tables_in_learning_sql_database
0               sql_lesson_1_movies
1              sql_lesson_boxoffice
2              sql_lesson_buildings
3              sql_lesson_employees
4  sql_lesson_north_american_cities

In [15]:
sql = """
SELECT *
FROM sql_lesson_employees
"""

pd.read_sql_query(sql, mydb)

        Role        Name Building  Years_employed
0   Engineer    Becky A.       1e               4
1   Engineer      Dan B.       1e               2
2   Engineer   Sharon F.       1e               6
3   Engineer      Dan M.       1e               4
4   Engineer   Malcom S.       1e               1
5     Artist    Tylar S.       2w               2
6     Artist  Sherman D.       2w               8
7     Artist    Jakob J.       2w               6
8     Artist   Lillia A.       2w               7
9     Artist  Brandon J.       2w               7
10   Manager    Scott K.       1e               9
11  Engineer    Yancy I.     None               0
12   Manager    Daria O.       2w               6
13    Artist   Oliver P.     None               0

### IS/IS NOT NULL

In [17]:
# Find the name and role of all employees who have not been assigned to a building
sql = """
SELECT name, role
FROM sql_lesson_employees
WHERE building IS NULL
"""

pd.read_sql_query(sql, mydb)

        name      role
0   Yancy I.  Engineer
1  Oliver P.    Artist

In [25]:
# Find the names of the buildings that hold no employees 
sql = """
SELECT DISTINCT building_name
FROM sql_lesson_buildings
LEFT JOIN sql_lesson_employees
ON building_name = building
WHERE building IS NULL
"""

pd.read_sql_query(sql, mydb)

  building_name
0            1w
1            2e

In [26]:
# Find the names of the buildings that hold employees 
sql = """
SELECT DISTINCT building_name
FROM sql_lesson_buildings
LEFT JOIN sql_lesson_employees
ON building_name = building
WHERE building IS NOT NULL
"""

pd.read_sql_query(sql, mydb)

  building_name
0            1e
1            2w